grevaillot/svd_tools/headers/ATSAMV71N21B/piob.h
/** @defgroup piob_pio_codr PIOCODR Clear Output Data Register
@{*/

/** PIOB_PIO_CODR_P31 Clear Output Data **/
#define PIOB_PIO_CODR_P31		(1 << 31)
/** PIOB_PIO_CODR_P30 Clear Output Data **/
#define PIOB_PIO_CODR_P30		(1 << 30)
/** PIOB_PIO_CODR_P29 Clear Output Data **/
#define PIOB_PIO_CODR_P29		(1 << 29)
/** PIOB_PIO_CODR_P28 Clear Output Data **/
#define PIOB_PIO_CODR_P28		(1 << 28)
/** PIOB_PIO_CODR_P27 Clear Output Data **/
#define PIOB_PIO_CODR_P27		(1 << 27)
/** PIOB_PIO_CODR_P26 Clear Output Data **/
#define PIOB_PIO_CODR_P26		(1 << 26)
/** PIOB_PIO_CODR_P25 Clear Output Data **/
#define PIOB_PIO_CODR_P25		(1 << 25)
/** PIOB_PIO_CODR_P24 Clear Output Data **/
#define PIOB_PIO_CODR_P24		(1 << 24)
/** PIOB_PIO_CODR_P23 Clear Output Data **/
#define PIOB_PIO_CODR_P23		(1 << 23)
/** PIOB_PIO_CODR_P22 Clear Output Data **/
#define PIOB_PIO_CODR_P22		(1 << 22)
/** PIOB_PIO_CODR_P21 Clear Output Data **/
#define PIOB_PIO_CODR_P21		(1 << 21)
/** PIOB_PIO_CODR_P20 Clear Output Data **/
#define PIOB_PIO_CODR_P20		(1 << 20)
/** PIOB_PIO_CODR_P19 Clear Output Data **/
#define PIOB_PIO_CODR_P19		(1 << 19)
/** PIOB_PIO_CODR_P18 Clear Output Data **/
#define PIOB_PIO_CODR_P18		(1 << 18)
/** PIOB_PIO_CODR_P17 Clear Output Data **/
#define PIOB_PIO_CODR_P17		(1 << 17)
/** PIOB_PIO_CODR_P16 Clear Output Data **/
#define PIOB_PIO_CODR_P16		(1 << 16)
/** PIOB_PIO_CODR_P15 Clear Output Data **/
#define PIOB_PIO_CODR_P15		(1 << 15)
/** PIOB_PIO_CODR_P14 Clear Output Data **/
#define PIOB_PIO_CODR_P14		(1 << 14)
/** PIOB_PIO_CODR_P13 Clear Output Data **/
#define PIOB_PIO_CODR_P13		(1 << 13)
/** PIOB_PIO_CODR_P12 Clear Output Data **/
#define PIOB_PIO_CODR_P12		(1 << 12)
/** PIOB_PIO_CODR_P11 Clear Output Data **/
#define PIOB_PIO_CODR_P11		(1 << 11)
/** PIOB_PIO_CODR_P10 Clear Output Data **/
#define PIOB_PIO_CODR_P10		(1 << 10)
/** PIOB_PIO_CODR_P9 Clear Output Data **/
#define PIOB_PIO_CODR_P9		(1 << 9)
/** PIOB_PIO_CODR_P8 Clear Output Data **/
#define PIOB_PIO_CODR_P8		(1 << 8)
/** PIOB_PIO_CODR_P7 Clear Output Data **/
#define PIOB_PIO_CODR_P7		(1 << 7)
/** PIOB_PIO_CODR_P6 Clear Output Data **/
#define PIOB_PIO_CODR_P6		(1 << 6)
/** PIOB_PIO_CODR_P5 Clear Output Data **/
#define PIOB_PIO_CODR_P5		(1 << 5)
/** PIOB_PIO_CODR_P4 Clear Output Data **/
#define PIOB_PIO_CODR_P4		(1 << 4)
/** PIOB_PIO_CODR_P3 Clear Output Data **/
#define PIOB_PIO_CODR_P3		(1 << 3)
/** PIOB_PIO_CODR_P2 Clear Output Data **/
#define PIOB_PIO_CODR_P2		(1 << 2)
/** PIOB_PIO_CODR_P1 Clear Output Data **/
#define PIOB_PIO_CODR_P1		(1 << 1)
/** PIOB_PIO_CODR_P0 Clear Output Data **/
#define PIOB_PIO_CODR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_odsr PIOODSR Output Data Status Register
@{*/

/** PIOB_PIO_ODSR_P31 Output Data Status **/
#define PIOB_PIO_ODSR_P31		(1 << 31)
/** PIOB_PIO_ODSR_P30 Output Data Status **/
#define PIOB_PIO_ODSR_P30		(1 << 30)
/** PIOB_PIO_ODSR_P29 Output Data Status **/
#define PIOB_PIO_ODSR_P29		(1 << 29)
/** PIOB_PIO_ODSR_P28 Output Data Status **/
#define PIOB_PIO_ODSR_P28		(1 << 28)
/** PIOB_PIO_ODSR_P27 Output Data Status **/
#define PIOB_PIO_ODSR_P27		(1 << 27)
/** PIOB_PIO_ODSR_P26 Output Data Status **/
#define PIOB_PIO_ODSR_P26		(1 << 26)
/** PIOB_PIO_ODSR_P25 Output Data Status **/
#define PIOB_PIO_ODSR_P25		(1 << 25)
/** PIOB_PIO_ODSR_P24 Output Data Status **/
#define PIOB_PIO_ODSR_P24		(1 << 24)
/** PIOB_PIO_ODSR_P23 Output Data Status **/
#define PIOB_PIO_ODSR_P23		(1 << 23)
/** PIOB_PIO_ODSR_P22 Output Data Status **/
#define PIOB_PIO_ODSR_P22		(1 << 22)
/** PIOB_PIO_ODSR_P21 Output Data Status **/
#define PIOB_PIO_ODSR_P21		(1 << 21)
/** PIOB_PIO_ODSR_P20 Output Data Status **/
#define PIOB_PIO_ODSR_P20		(1 << 20)
/** PIOB_PIO_ODSR_P19 Output Data Status **/
#define PIOB_PIO_ODSR_P19		(1 << 19)
/** PIOB_PIO_ODSR_P18 Output Data Status **/
#define PIOB_PIO_ODSR_P18		(1 << 18)
/** PIOB_PIO_ODSR_P17 Output Data Status **/
#define PIOB_PIO_ODSR_P17		(1 << 17)
/** PIOB_PIO_ODSR_P16 Output Data Status **/
#define PIOB_PIO_ODSR_P16		(1 << 16)
/** PIOB_PIO_ODSR_P15 Output Data Status **/
#define PIOB_PIO_ODSR_P15		(1 << 15)
/** PIOB_PIO_ODSR_P14 Output Data Status **/
#define PIOB_PIO_ODSR_P14		(1 << 14)
/** PIOB_PIO_ODSR_P13 Output Data Status **/
#define PIOB_PIO_ODSR_P13		(1 << 13)
/** PIOB_PIO_ODSR_P12 Output Data Status **/
#define PIOB_PIO_ODSR_P12		(1 << 12)
/** PIOB_PIO_ODSR_P11 Output Data Status **/
#define PIOB_PIO_ODSR_P11		(1 << 11)
/** PIOB_PIO_ODSR_P10 Output Data Status **/
#define PIOB_PIO_ODSR_P10		(1 << 10)
/** PIOB_PIO_ODSR_P9 Output Data Status **/
#define PIOB_PIO_ODSR_P9		(1 << 9)
/** PIOB_PIO_ODSR_P8 Output Data Status **/
#define PIOB_PIO_ODSR_P8		(1 << 8)
/** PIOB_PIO_ODSR_P7 Output Data Status **/
#define PIOB_PIO_ODSR_P7		(1 << 7)
/** PIOB_PIO_ODSR_P6 Output Data Status **/
#define PIOB_PIO_ODSR_P6		(1 << 6)
/** PIOB_PIO_ODSR_P5 Output Data Status **/
#define PIOB_PIO_ODSR_P5		(1 << 5)
/** PIOB_PIO_ODSR_P4 Output Data Status **/
#define PIOB_PIO_ODSR_P4		(1 << 4)
/** PIOB_PIO_ODSR_P3 Output Data Status **/
#define PIOB_PIO_ODSR_P3		(1 << 3)
/** PIOB_PIO_ODSR_P2 Output Data Status **/
#define PIOB_PIO_ODSR_P2		(1 << 2)
/** PIOB_PIO_ODSR_P1 Output Data Status **/
#define PIOB_PIO_ODSR_P1		(1 << 1)
/** PIOB_PIO_ODSR_P0 Output Data Status **/
#define PIOB_PIO_ODSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pdsr PIOPDSR Pin Data Status Register
@{*/

/** PIOB_PIO_PDSR_P31 Output Data Status **/
#define PIOB_PIO_PDSR_P31		(1 << 31)
/** PIOB_PIO_PDSR_P30 Output Data Status **/
#define PIOB_PIO_PDSR_P30		(1 << 30)
/** PIOB_PIO_PDSR_P29 Output Data Status **/
#define PIOB_PIO_PDSR_P29		(1 << 29)
/** PIOB_PIO_PDSR_P28 Output Data Status **/
#define PIOB_PIO_PDSR_P28		(1 << 28)
/** PIOB_PIO_PDSR_P27 Output Data Status **/
#define PIOB_PIO_PDSR_P27		(1 << 27)
/** PIOB_PIO_PDSR_P26 Output Data Status **/
#define PIOB_PIO_PDSR_P26		(1 << 26)
/** PIOB_PIO_PDSR_P25 Output Data Status **/
#define PIOB_PIO_PDSR_P25		(1 << 25)
/** PIOB_PIO_PDSR_P24 Output Data Status **/
#define PIOB_PIO_PDSR_P24		(1 << 24)
/** PIOB_PIO_PDSR_P23 Output Data Status **/
#define PIOB_PIO_PDSR_P23		(1 << 23)
/** PIOB_PIO_PDSR_P22 Output Data Status **/
#define PIOB_PIO_PDSR_P22		(1 << 22)
/** PIOB_PIO_PDSR_P21 Output Data Status **/
#define PIOB_PIO_PDSR_P21		(1 << 21)
/** PIOB_PIO_PDSR_P20 Output Data Status **/
#define PIOB_PIO_PDSR_P20		(1 << 20)
/** PIOB_PIO_PDSR_P19 Output Data Status **/
#define PIOB_PIO_PDSR_P19		(1 << 19)
/** PIOB_PIO_PDSR_P18 Output Data Status **/
#define PIOB_PIO_PDSR_P18		(1 << 18)
/** PIOB_PIO_PDSR_P17 Output Data Status **/
#define PIOB_PIO_PDSR_P17		(1 << 17)
/** PIOB_PIO_PDSR_P16 Output Data Status **/
#define PIOB_PIO_PDSR_P16		(1 << 16)
/** PIOB_PIO_PDSR_P15 Output Data Status **/
#define PIOB_PIO_PDSR_P15		(1 << 15)
/** PIOB_PIO_PDSR_P14 Output Data Status **/
#define PIOB_PIO_PDSR_P14		(1 << 14)
/** PIOB_PIO_PDSR_P13 Output Data Status **/
#define PIOB_PIO_PDSR_P13		(1 << 13)
/** PIOB_PIO_PDSR_P12 Output Data Status **/
#define PIOB_PIO_PDSR_P12		(1 << 12)
/** PIOB_PIO_PDSR_P11 Output Data Status **/
#define PIOB_PIO_PDSR_P11		(1 << 11)
/** PIOB_PIO_PDSR_P10 Output Data Status **/
#define PIOB_PIO_PDSR_P10		(1 << 10)
/** PIOB_PIO_PDSR_P9 Output Data Status **/
#define PIOB_PIO_PDSR_P9		(1 << 9)
/** PIOB_PIO_PDSR_P8 Output Data Status **/
#define PIOB_PIO_PDSR_P8		(1 << 8)
/** PIOB_PIO_PDSR_P7 Output Data Status **/
#define PIOB_PIO_PDSR_P7		(1 << 7)
/** PIOB_PIO_PDSR_P6 Output Data Status **/
#define PIOB_PIO_PDSR_P6		(1 << 6)
/** PIOB_PIO_PDSR_P5 Output Data Status **/
#define PIOB_PIO_PDSR_P5		(1 << 5)
/** PIOB_PIO_PDSR_P4 Output Data Status **/
#define PIOB_PIO_PDSR_P4		(1 << 4)
/** PIOB_PIO_PDSR_P3 Output Data Status **/
#define PIOB_PIO_PDSR_P3		(1 << 3)
/** PIOB_PIO_PDSR_P2 Output Data Status **/
#define PIOB_PIO_PDSR_P2		(1 << 2)
/** PIOB_PIO_PDSR_P1 Output Data Status **/
#define PIOB_PIO_PDSR_P1		(1 << 1)
/** PIOB_PIO_PDSR_P0 Output Data Status **/
#define PIOB_PIO_PDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_ier PIOIER Interrupt Enable Register
@{*/

/** PIOB_PIO_IER_P31 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P31		(1 << 31)
/** PIOB_PIO_IER_P30 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P30		(1 << 30)
/** PIOB_PIO_IER_P29 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P29		(1 << 29)
/** PIOB_PIO_IER_P28 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P28		(1 << 28)
/** PIOB_PIO_IER_P27 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P27		(1 << 27)
/** PIOB_PIO_IER_P26 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P26		(1 << 26)
/** PIOB_PIO_IER_P25 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P25		(1 << 25)
/** PIOB_PIO_IER_P24 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P24		(1 << 24)
/** PIOB_PIO_IER_P23 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P23		(1 << 23)
/** PIOB_PIO_IER_P22 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P22		(1 << 22)
/** PIOB_PIO_IER_P21 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P21		(1 << 21)
/** PIOB_PIO_IER_P20 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P20		(1 << 20)
/** PIOB_PIO_IER_P19 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P19		(1 << 19)
/** PIOB_PIO_IER_P18 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P18		(1 << 18)
/** PIOB_PIO_IER_P17 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P17		(1 << 17)
/** PIOB_PIO_IER_P16 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P16		(1 << 16)
/** PIOB_PIO_IER_P15 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P15		(1 << 15)
/** PIOB_PIO_IER_P14 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P14		(1 << 14)
/** PIOB_PIO_IER_P13 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P13		(1 << 13)
/** PIOB_PIO_IER_P12 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P12		(1 << 12)
/** PIOB_PIO_IER_P11 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P11		(1 << 11)
/** PIOB_PIO_IER_P10 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P10		(1 << 10)
/** PIOB_PIO_IER_P9 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P9		(1 << 9)
/** PIOB_PIO_IER_P8 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P8		(1 << 8)
/** PIOB_PIO_IER_P7 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P7		(1 << 7)
/** PIOB_PIO_IER_P6 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P6		(1 << 6)
/** PIOB_PIO_IER_P5 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P5		(1 << 5)
/** PIOB_PIO_IER_P4 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P4		(1 << 4)
/** PIOB_PIO_IER_P3 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P3		(1 << 3)
/** PIOB_PIO_IER_P2 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P2		(1 << 2)
/** PIOB_PIO_IER_P1 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P1		(1 << 1)
/** PIOB_PIO_IER_P0 Input Change Interrupt Enable **/
#define PIOB_PIO_IER_P0		(1 << 0)

/**@}*/

