grevaillot/svd_tools/headers/ATSAMV71N21B/piob.h
/** PIOB_PIO_MDSR_P31 Multi-drive Status **/
#define PIOB_PIO_MDSR_P31		(1 << 31)
/** PIOB_PIO_MDSR_P30 Multi-drive Status **/
#define PIOB_PIO_MDSR_P30		(1 << 30)
/** PIOB_PIO_MDSR_P29 Multi-drive Status **/
#define PIOB_PIO_MDSR_P29		(1 << 29)
/** PIOB_PIO_MDSR_P28 Multi-drive Status **/
#define PIOB_PIO_MDSR_P28		(1 << 28)
/** PIOB_PIO_MDSR_P27 Multi-drive Status **/
#define PIOB_PIO_MDSR_P27		(1 << 27)
/** PIOB_PIO_MDSR_P26 Multi-drive Status **/
#define PIOB_PIO_MDSR_P26		(1 << 26)
/** PIOB_PIO_MDSR_P25 Multi-drive Status **/
#define PIOB_PIO_MDSR_P25		(1 << 25)
/** PIOB_PIO_MDSR_P24 Multi-drive Status **/
#define PIOB_PIO_MDSR_P24		(1 << 24)
/** PIOB_PIO_MDSR_P23 Multi-drive Status **/
#define PIOB_PIO_MDSR_P23		(1 << 23)
/** PIOB_PIO_MDSR_P22 Multi-drive Status **/
#define PIOB_PIO_MDSR_P22		(1 << 22)
/** PIOB_PIO_MDSR_P21 Multi-drive Status **/
#define PIOB_PIO_MDSR_P21		(1 << 21)
/** PIOB_PIO_MDSR_P20 Multi-drive Status **/
#define PIOB_PIO_MDSR_P20		(1 << 20)
/** PIOB_PIO_MDSR_P19 Multi-drive Status **/
#define PIOB_PIO_MDSR_P19		(1 << 19)
/** PIOB_PIO_MDSR_P18 Multi-drive Status **/
#define PIOB_PIO_MDSR_P18		(1 << 18)
/** PIOB_PIO_MDSR_P17 Multi-drive Status **/
#define PIOB_PIO_MDSR_P17		(1 << 17)
/** PIOB_PIO_MDSR_P16 Multi-drive Status **/
#define PIOB_PIO_MDSR_P16		(1 << 16)
/** PIOB_PIO_MDSR_P15 Multi-drive Status **/
#define PIOB_PIO_MDSR_P15		(1 << 15)
/** PIOB_PIO_MDSR_P14 Multi-drive Status **/
#define PIOB_PIO_MDSR_P14		(1 << 14)
/** PIOB_PIO_MDSR_P13 Multi-drive Status **/
#define PIOB_PIO_MDSR_P13		(1 << 13)
/** PIOB_PIO_MDSR_P12 Multi-drive Status **/
#define PIOB_PIO_MDSR_P12		(1 << 12)
/** PIOB_PIO_MDSR_P11 Multi-drive Status **/
#define PIOB_PIO_MDSR_P11		(1 << 11)
/** PIOB_PIO_MDSR_P10 Multi-drive Status **/
#define PIOB_PIO_MDSR_P10		(1 << 10)
/** PIOB_PIO_MDSR_P9 Multi-drive Status **/
#define PIOB_PIO_MDSR_P9		(1 << 9)
/** PIOB_PIO_MDSR_P8 Multi-drive Status **/
#define PIOB_PIO_MDSR_P8		(1 << 8)
/** PIOB_PIO_MDSR_P7 Multi-drive Status **/
#define PIOB_PIO_MDSR_P7		(1 << 7)
/** PIOB_PIO_MDSR_P6 Multi-drive Status **/
#define PIOB_PIO_MDSR_P6		(1 << 6)
/** PIOB_PIO_MDSR_P5 Multi-drive Status **/
#define PIOB_PIO_MDSR_P5		(1 << 5)
/** PIOB_PIO_MDSR_P4 Multi-drive Status **/
#define PIOB_PIO_MDSR_P4		(1 << 4)
/** PIOB_PIO_MDSR_P3 Multi-drive Status **/
#define PIOB_PIO_MDSR_P3		(1 << 3)
/** PIOB_PIO_MDSR_P2 Multi-drive Status **/
#define PIOB_PIO_MDSR_P2		(1 << 2)
/** PIOB_PIO_MDSR_P1 Multi-drive Status **/
#define PIOB_PIO_MDSR_P1		(1 << 1)
/** PIOB_PIO_MDSR_P0 Multi-drive Status **/
#define PIOB_PIO_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pudr PIOPUDR Pull-up Disable Register
@{*/

/** PIOB_PIO_PUDR_P31 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P31		(1 << 31)
/** PIOB_PIO_PUDR_P30 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P30		(1 << 30)
/** PIOB_PIO_PUDR_P29 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P29		(1 << 29)
/** PIOB_PIO_PUDR_P28 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P28		(1 << 28)
/** PIOB_PIO_PUDR_P27 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P27		(1 << 27)
/** PIOB_PIO_PUDR_P26 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P26		(1 << 26)
/** PIOB_PIO_PUDR_P25 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P25		(1 << 25)
/** PIOB_PIO_PUDR_P24 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P24		(1 << 24)
/** PIOB_PIO_PUDR_P23 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P23		(1 << 23)
/** PIOB_PIO_PUDR_P22 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P22		(1 << 22)
/** PIOB_PIO_PUDR_P21 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P21		(1 << 21)
/** PIOB_PIO_PUDR_P20 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P20		(1 << 20)
/** PIOB_PIO_PUDR_P19 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P19		(1 << 19)
/** PIOB_PIO_PUDR_P18 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P18		(1 << 18)
/** PIOB_PIO_PUDR_P17 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P17		(1 << 17)
/** PIOB_PIO_PUDR_P16 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P16		(1 << 16)
/** PIOB_PIO_PUDR_P15 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P15		(1 << 15)
/** PIOB_PIO_PUDR_P14 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P14		(1 << 14)
/** PIOB_PIO_PUDR_P13 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P13		(1 << 13)
/** PIOB_PIO_PUDR_P12 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P12		(1 << 12)
/** PIOB_PIO_PUDR_P11 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P11		(1 << 11)
/** PIOB_PIO_PUDR_P10 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P10		(1 << 10)
/** PIOB_PIO_PUDR_P9 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P9		(1 << 9)
/** PIOB_PIO_PUDR_P8 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P8		(1 << 8)
/** PIOB_PIO_PUDR_P7 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P7		(1 << 7)
/** PIOB_PIO_PUDR_P6 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P6		(1 << 6)
/** PIOB_PIO_PUDR_P5 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P5		(1 << 5)
/** PIOB_PIO_PUDR_P4 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P4		(1 << 4)
/** PIOB_PIO_PUDR_P3 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P3		(1 << 3)
/** PIOB_PIO_PUDR_P2 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P2		(1 << 2)
/** PIOB_PIO_PUDR_P1 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P1		(1 << 1)
/** PIOB_PIO_PUDR_P0 Pull-Up Disable **/
#define PIOB_PIO_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pio_puer PIOPUER Pull-up Enable Register
@{*/

/** PIOB_PIO_PUER_P31 Pull-Up Enable **/
#define PIOB_PIO_PUER_P31		(1 << 31)
/** PIOB_PIO_PUER_P30 Pull-Up Enable **/
#define PIOB_PIO_PUER_P30		(1 << 30)
/** PIOB_PIO_PUER_P29 Pull-Up Enable **/
#define PIOB_PIO_PUER_P29		(1 << 29)
/** PIOB_PIO_PUER_P28 Pull-Up Enable **/
#define PIOB_PIO_PUER_P28		(1 << 28)
/** PIOB_PIO_PUER_P27 Pull-Up Enable **/
#define PIOB_PIO_PUER_P27		(1 << 27)
/** PIOB_PIO_PUER_P26 Pull-Up Enable **/
#define PIOB_PIO_PUER_P26		(1 << 26)
/** PIOB_PIO_PUER_P25 Pull-Up Enable **/
#define PIOB_PIO_PUER_P25		(1 << 25)
/** PIOB_PIO_PUER_P24 Pull-Up Enable **/
#define PIOB_PIO_PUER_P24		(1 << 24)
/** PIOB_PIO_PUER_P23 Pull-Up Enable **/
#define PIOB_PIO_PUER_P23		(1 << 23)
/** PIOB_PIO_PUER_P22 Pull-Up Enable **/
#define PIOB_PIO_PUER_P22		(1 << 22)
/** PIOB_PIO_PUER_P21 Pull-Up Enable **/
#define PIOB_PIO_PUER_P21		(1 << 21)
/** PIOB_PIO_PUER_P20 Pull-Up Enable **/
#define PIOB_PIO_PUER_P20		(1 << 20)
/** PIOB_PIO_PUER_P19 Pull-Up Enable **/
#define PIOB_PIO_PUER_P19		(1 << 19)
/** PIOB_PIO_PUER_P18 Pull-Up Enable **/
#define PIOB_PIO_PUER_P18		(1 << 18)
/** PIOB_PIO_PUER_P17 Pull-Up Enable **/
#define PIOB_PIO_PUER_P17		(1 << 17)
/** PIOB_PIO_PUER_P16 Pull-Up Enable **/
#define PIOB_PIO_PUER_P16		(1 << 16)
/** PIOB_PIO_PUER_P15 Pull-Up Enable **/
#define PIOB_PIO_PUER_P15		(1 << 15)
/** PIOB_PIO_PUER_P14 Pull-Up Enable **/
#define PIOB_PIO_PUER_P14		(1 << 14)
/** PIOB_PIO_PUER_P13 Pull-Up Enable **/
#define PIOB_PIO_PUER_P13		(1 << 13)
/** PIOB_PIO_PUER_P12 Pull-Up Enable **/
#define PIOB_PIO_PUER_P12		(1 << 12)
/** PIOB_PIO_PUER_P11 Pull-Up Enable **/
#define PIOB_PIO_PUER_P11		(1 << 11)
/** PIOB_PIO_PUER_P10 Pull-Up Enable **/
#define PIOB_PIO_PUER_P10		(1 << 10)
/** PIOB_PIO_PUER_P9 Pull-Up Enable **/
#define PIOB_PIO_PUER_P9		(1 << 9)
/** PIOB_PIO_PUER_P8 Pull-Up Enable **/
#define PIOB_PIO_PUER_P8		(1 << 8)
/** PIOB_PIO_PUER_P7 Pull-Up Enable **/
#define PIOB_PIO_PUER_P7		(1 << 7)
/** PIOB_PIO_PUER_P6 Pull-Up Enable **/
#define PIOB_PIO_PUER_P6		(1 << 6)
/** PIOB_PIO_PUER_P5 Pull-Up Enable **/
#define PIOB_PIO_PUER_P5		(1 << 5)
/** PIOB_PIO_PUER_P4 Pull-Up Enable **/
#define PIOB_PIO_PUER_P4		(1 << 4)
/** PIOB_PIO_PUER_P3 Pull-Up Enable **/
#define PIOB_PIO_PUER_P3		(1 << 3)
/** PIOB_PIO_PUER_P2 Pull-Up Enable **/
#define PIOB_PIO_PUER_P2		(1 << 2)
/** PIOB_PIO_PUER_P1 Pull-Up Enable **/
#define PIOB_PIO_PUER_P1		(1 << 1)
/** PIOB_PIO_PUER_P0 Pull-Up Enable **/
#define PIOB_PIO_PUER_P0		(1 << 0)

/**@}*/

