grevaillot/svd_tools/headers/ATSAMV71N21B/piob.h
/** @defgroup piob_pio_pcmr PIOPCMR Parallel Capture Mode Register
@{*/

/** PIOB_PIO_PCMR_FRSTS Parallel Capture Mode First Sample **/
#define PIOB_PIO_PCMR_FRSTS		(1 << 11)
/** PIOB_PIO_PCMR_HALFS Parallel Capture Mode Half Sampling **/
#define PIOB_PIO_PCMR_HALFS		(1 << 10)
/** PIOB_PIO_PCMR_ALWYS Parallel Capture Mode Always Sampling **/
#define PIOB_PIO_PCMR_ALWYS		(1 << 9)

#define PIOB_PIO_PCMR_DSIZE_SHIFT		4
#define PIOB_PIO_PCMR_DSIZE_MASK		0x03
/** @defgroup piob_pio_pcmr_dsize DSIZE Parallel Capture Mode Data Size
@{*/
/**@}*/

/** PIOB_PIO_PCMR_PCEN Parallel Capture Mode Enable **/
#define PIOB_PIO_PCMR_PCEN		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pcier PIOPCIER Parallel Capture Interrupt Enable Register
@{*/

/** PIOB_PIO_PCIER_RXBUFF Reception Buffer Full Interrupt Enable **/
#define PIOB_PIO_PCIER_RXBUFF		(1 << 3)
/** PIOB_PIO_PCIER_ENDRX End of Reception Transfer Interrupt Enable **/
#define PIOB_PIO_PCIER_ENDRX		(1 << 2)
/** PIOB_PIO_PCIER_OVRE Parallel Capture Mode Overrun Error Interrupt Enable **/
#define PIOB_PIO_PCIER_OVRE		(1 << 1)
/** PIOB_PIO_PCIER_DRDY Parallel Capture Mode Data Ready Interrupt Enable **/
#define PIOB_PIO_PCIER_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pcidr PIOPCIDR Parallel Capture Interrupt Disable Register
@{*/

/** PIOB_PIO_PCIDR_RXBUFF Reception Buffer Full Interrupt Disable **/
#define PIOB_PIO_PCIDR_RXBUFF		(1 << 3)
/** PIOB_PIO_PCIDR_ENDRX End of Reception Transfer Interrupt Disable **/
#define PIOB_PIO_PCIDR_ENDRX		(1 << 2)
/** PIOB_PIO_PCIDR_OVRE Parallel Capture Mode Overrun Error Interrupt Disable **/
#define PIOB_PIO_PCIDR_OVRE		(1 << 1)
/** PIOB_PIO_PCIDR_DRDY Parallel Capture Mode Data Ready Interrupt Disable **/
#define PIOB_PIO_PCIDR_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pcimr PIOPCIMR Parallel Capture Interrupt Mask Register
@{*/

/** PIOB_PIO_PCIMR_RXBUFF Reception Buffer Full Interrupt Mask **/
#define PIOB_PIO_PCIMR_RXBUFF		(1 << 3)
/** PIOB_PIO_PCIMR_ENDRX End of Reception Transfer Interrupt Mask **/
#define PIOB_PIO_PCIMR_ENDRX		(1 << 2)
/** PIOB_PIO_PCIMR_OVRE Parallel Capture Mode Overrun Error Interrupt Mask **/
#define PIOB_PIO_PCIMR_OVRE		(1 << 1)
/** PIOB_PIO_PCIMR_DRDY Parallel Capture Mode Data Ready Interrupt Mask **/
#define PIOB_PIO_PCIMR_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pcisr PIOPCISR Parallel Capture Interrupt Status Register
@{*/

/** PIOB_PIO_PCISR_OVRE Parallel Capture Mode Overrun Error **/
#define PIOB_PIO_PCISR_OVRE		(1 << 1)
/** PIOB_PIO_PCISR_DRDY Parallel Capture Mode Data Ready **/
#define PIOB_PIO_PCISR_DRDY		(1 << 0)

/**@}*/

/** @defgroup piob_pio_pcrhr PIOPCRHR Parallel Capture Reception Holding Register
@{*/


#define PIOB_PIO_PCRHR_RDATA_SHIFT		0
#define PIOB_PIO_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup piob_pio_pcrhr_rdata RDATA Parallel Capture Mode Reception Data
@{*/
/**@}*/


/**@}*/
